app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Scott Stephenson"], ["created_at", "2015-02-18 20:09:17.059034"], ["updated_at", "2015-02-18 20:09:17.059034"]]
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save