app/controllers/orders_controller.rb

  def create
    @order = @customer.orders.new

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("customer_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["customer_id", 4], ["created_at", "2015-02-18 21:27:50.622536"], ["updated_at", "2015-02-18 21:27:50.622536"]]

    def set_order
      @order = Customer.find(params[:customer_id]).orders.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "orders".* FROM "orders" WHERE "orders"."customer_id" = ? AND "orders"."id" = ? LIMIT 1  [["customer_id", 4], ["id", 2]]